const About = () => {
   return (
      <div className='border-t-2 p-5 border-black/25 rounded-2xl bg-gradient-to-b from-orange-200 to-orange-50'>
         <h2 className='mb-10 mt-3 text-right justify-center flex'>
            من کی هستم <br /> و چیکار می‌کنم؟
         </h2>

         <p className='yekan rtl text-justify leading-7'>
            با سلام 👋 <br />
            من <span className='yekanBold text-base'>علی اسدی</span> هستم، یک طراح با تجربه در زمینه
            گرافیک و طراحی. تجربه‌ی چندین ساله‌ام در این حوزه به من این امکان را داده تا به عنوان{' '}
            <span className='yekanBold text-base'>یک هنرمند و طراح مستقل</span> در خدمت شما باشم.{' '}
            <br />
            <br />
            در کارهایم، تمام تلاشم را می‌کنم تا{' '}
            <span className='yekanBold text-base'>طرح‌هایی منحصر به فرد و اختصاصی</span> ارائه دهم
            که <span className='yekanBold text-base'>بازتابی از شخصیت و سلیقه‌ی شما</span> داشته
            باشند. <span className='yekanBold text-base'>نمونه کارهای من</span> در این وبسایت{' '}
            <span className='yekanBold text-base'>نمایانگر سبک و توانایی‌های من</span> در زمینه
            طراحی هستند و به عنوان نمونه‌های آماده برای اشنایی با کارهای من ارائه شده‌اند. این{' '}
            <span className='yekanBold text-base'>نمونه کارها به صورت غیر قابل فروش</span> می‌باشند.{' '}
            <br />
            <br />
            فرآیند همکاری با من به این صورت است که ابتدا نمونه کارهای موجود در وبسایت را بررسی
            می‌کنید. اگر از سبک و کیفیت کارهای من راضی شدید،{' '}
            <span className='yekanBold text-base'>با من به شکل مستقیم از طریق تلگرام</span>، نیازها
            و توقعات خود را مطرح می‌کنید. سپس من{' '}
            <span className='yekanBold text-base'>با دقت به تمام جزئیات</span>، طراحی اختصاصی شما را
            انجام می‌دهم تا به بهترین نتیجه برسید. <br />
            <br />
            من در خدمت شما هستم تا در هر مرحله از پروژه‌هایتان، شما را راهنمایی کنم و در{' '}
            <span className='yekanBold text-base'>ایجاد برندی بی‌نظیر</span> همراه شما باشم.
         </p>
      </div>
   )
}

export default About
